tutorials/incompressible/lumpedPointMotion/building/steady/system/lumpedPointMovement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      lumpedPointMovement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Reference axis for the locations
axis            (0 0 1);

// Locations of the lumped points
locations       11(0 0.05 0.1 0.15 0.2 0.25 0.3 0.35 0.4 0.45 0.5);

// Division for pressure forces (0-1)
division        0.5;

//- If present, the offset of patch points compared to the locations
//  Otherwise determined from the bounding box
// centre          (0 0 0);

//- The interpolation scheme
interpolationScheme linear;

//- Relaxation/scaling factor when updating positions
relax           1.0;


forces
{
    //- The pressure name (default: p)
    p           p;

    //- Reference pressure [Pa] (default: 0)
    pRef        0;

    //- Reference density for incompressible calculations (default: 1)
    rhoRef      1;
}


communication
{
    commsDir        "comms";

    log             on;

    waitInterval    1;

    timeOut         100;

    initByExternal  false;

    // Input file of positions/rotation, written by external application
    inputName       positions.in;

    // Output file of forces, written by OpenFOAM
    outputName      forces.out;

    inputFormat     dictionary;
    outputFormat    dictionary;

    debugTable      "$FOAM_CASE/output.txt";
}

// ************************************************************************* //
